------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/xiongyiliang/Workspace/Stata/sprobit/mle_example.log
  log type:  text
 opened on:  17 Aug 2011, 19:25:55
r; t=0.00 19:25:55

. 
. ******** define household identity
. global hid sampno
r; t=0.00 19:25:55

. sort sampno
r; t=0.02 19:25:56

. 
. ******** deifne dependent and independent variables 
. global y choice
r; t=0.00 19:25:56

. global X x1 x2
r; t=0.00 19:25:56

. 
. ******** get initial b0 from probit
. set rmsg on
r; t=0.00 19:25:56

. probit $y $X

Iteration 0:   log likelihood = -1569.3508  
Iteration 1:   log likelihood = -858.02714  
Iteration 2:   log likelihood = -837.01513  
Iteration 3:   log likelihood = -836.92939  
Iteration 4:   log likelihood = -836.92938  

Probit regression                                 Number of obs   =       2400
                                                  LR chi2(2)      =    1464.84
                                                  Prob > chi2     =     0.0000
Log likelihood = -836.92938                       Pseudo R2       =     0.4667

------------------------------------------------------------------------------
      choice |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          x1 |   .6762532   .0310374    21.79   0.000      .615421    .7370853
          x2 |   1.368089   .0539109    25.38   0.000     1.262426    1.473752
       _cons |  -.3133074   .0401662    -7.80   0.000    -.3920318   -.2345831
------------------------------------------------------------------------------
r; t=0.56 19:25:56

. set rmsg off

. matrix b0 = e(b)

. 
. ******** estimation procedure: increase `drnum' gradually
. local drlist 10 20 50

. foreach drnum of local drlist {
  2.         // create `drnum' Halton draws
.         set rmsg on
  3.         mdraws, dr(`drnum') neq($NM) prefix(z) burn(15) antithetics replace
  4.         set rmsg off
  5.         return list
  6.         global dr = r(n_draws)
  7. 
.         // call simulation-based ML
.         ml model d0 sprobit_d0 (choice: $y = $X) /r, tech(nr) ///
>         title(Spatial Probit Model, $dr Random Draws)
  8.         ml init b0
  9.         set rmsg on
 10.         ml maximize, difficult
 11.         set rmsg off
 12. 
.         // update initial b0
.         matrix b0 = e(b)
 13. }
could not restore sort order because variables were dropped
--Break--
r(1); t=0.00 19:26:08

end of do-file

--Break--
r(1); t=12.99 19:26:08

. do "/Users/xiongyiliang/Workspace/Stata/sprobit/simulate_data.do"

. ******** generate data for the simulation study
. version 11
r; t=0.00 19:27:11

. cap log close
