-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/xiongyiliang/Workspace/Stata/sprobit/mle_BATS96.log
  log type:  text
 opened on:  14 Aug 2011, 17:10:02
r; t=0.00 17:10:02

. 
. ******** global varibles
. qui tab actcode
r; t=0.00 17:10:02

. global M = r(r)
r; t=0.00 17:10:02

. qui tab relate
r; t=0.00 17:10:02

. global N = r(r)
r; t=0.00 17:10:02

. global NM = $N*$M
r; t=0.00 17:10:02

. disp $NM
8
r; t=0.00 17:10:02

. matrix Wk = (0.0, 0.5 \ 0.5, 0.0)
r; t=0.00 17:10:02

. matrix W  = Wk # I($M)
r; t=0.00 17:10:02

. /*
>         TODO Define economic distance matrix: 
>                  Differences of total working hours between husband and wife
>         NOTE The spatial weight matrix W is highly sparse. 
>         NOTE The resulting weights are meaningful, finite and non-negative.
>         NOTE It is also important to maintain the weights matrix as exogenous.
>         NOTE When a scaling factor, such as a spatial autoregressive coefficient, 
>                 is included together with parameterized weights, both sets of parameters 
>                 are not necessarily identified.
> */
. 
. ******** define household identity
. global hid sampno
r; t=0.00 17:10:02

. sort sampno persno
r; t=0.00 17:10:02

. 
. ******** deifne dependent and independent variables 
. global y choice
r; t=0.00 17:10:02

. global X age i.gender i.employ
r; t=0.00 17:10:02

. /*
>         CHANGED remove i.student from independent variables
>         CHANGED and also consider significance of _cons after removal of i.student
>         CHANGED add drive license as independent variables (or in weight matrix?)
>         CHANGED remove drive license (not siginificant)
>         CHANGED Heteroscedastic covariance matrix: 
>                         The full spatial model is premultiplied by the variance-normalizing 
>                         transformation diagonal matrix.
>         TODO number of cars within the household
>         TODO number of children under 6-year old 6 to 12-year
> */
. 
. ******** get initial b0 from probit
. set rmsg on
r; t=0.00 17:10:02

. probit $y $X

Iteration 0:   log likelihood = -3650.6876  
Iteration 1:   log likelihood = -3627.3121  
Iteration 2:   log likelihood = -3627.3106  
Iteration 3:   log likelihood = -3627.3106  

Probit regression                                 Number of obs   =       5560
                                                  LR chi2(3)      =      46.75
                                                  Prob > chi2     =     0.0000
Log likelihood = -3627.3106                       Pseudo R2       =     0.0064

------------------------------------------------------------------------------
      choice |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0060069   .0013359    -4.50   0.000    -.0086252   -.0033886
    2.gender |   .1211322   .0357415     3.39   0.001     .0510802    .1911842
    2.employ |   .1628417   .0416996     3.91   0.000     .0811121    .2445714
       _cons |  -.1741976   .0663314    -2.63   0.009    -.3042047   -.0441904
------------------------------------------------------------------------------
r; t=15.75 17:10:18

. set rmsg off

. matrix b0 = e(b)

. 
. ******** estimation procedure: increase `drnum' gradually
. local drlist 2 10 20 50

. foreach drnum of local drlist {
  2.         // create `drnum' Halton draws
.         set rmsg on
  3.         mdraws, dr(`drnum') neq($NM) prefix(z) burn(15) antithetics replace
  4.         set rmsg off
  5.         return list
  6.         global dr = r(n_draws)
  7. 
.         // call simulation-based ML
.         ml model d0 sprobit_d0 (choice: $y = $X) /r, tech(nr) ///
>         title(Spatial Probit Model, $dr Random Draws)
  8.         ml init b0
  9.         set rmsg on
 10.         ml maximize, difficult
 11.         set rmsg off
 12. 
.         // update initial b0
.         matrix b0 = e(b)
 13. }
Created 2 Halton draws per equation for 8 dimensions. Number of initial draws dropped per dimension = 15 .
Primes used:

   2   3   5   7  11  13  17  19
Also created 2 antithetic draws per dimension for 8 dimensions.  Note: there are now 4 draws per equation

scalars:
            r(n_draws) =  4
       r(n_dimensions) =  8
             r(n_burn) =  15

macros:
        r(antithetics) : "yes"
             r(prefix) : "z"
               r(type) : "halton"

matrices:
             r(primes) :  1 x 8

initial:       log likelihood = -3627.3106
rescale:       log likelihood = -3627.3106
rescale eq:    log likelihood = -3627.3106
Iteration 0:   log likelihood = -3627.3106  
Iteration 1:   log likelihood = -3237.8854  (not concave)
Iteration 2:   log likelihood =  -3236.971  (not concave)
Iteration 3:   log likelihood = -3236.7786  (not concave)
Iteration 4:   log likelihood = -3236.5418  
Iteration 5:   log likelihood = -3236.3103  (not concave)
Iteration 6:   log likelihood = -3236.1355  (not concave)
Iteration 7:   log likelihood = -3236.0499  (not concave)
Iteration 8:   log likelihood = -3236.0159  (not concave)
Iteration 9:   log likelihood = -3235.9803  
Iteration 10:  log likelihood = -3235.9565  (not concave)
Iteration 11:  log likelihood = -3235.9448  
Iteration 12:  log likelihood = -3235.9387  (not concave)
Iteration 13:  log likelihood = -3235.9345  (not concave)
Iteration 14:  log likelihood = -3235.9099  
Iteration 15:  log likelihood = -3235.9062  (not concave)
Iteration 16:  log likelihood = -3235.9036  
Iteration 17:  log likelihood = -3235.9028  
Iteration 18:  log likelihood = -3235.9027  

Spatial Probit Model, 4 Random Draws              Number of obs   =       5560
                                                  Wald chi2(3)    =      69.17
Log likelihood = -3235.9027                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
      choice |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
choice       |
         age |   -.005823   .0013185    -4.42   0.000    -.0084071   -.0032388
    2.gender |   .2673513   .0477394     5.60   0.000     .1737837    .3609189
    2.employ |   .1721718   .0432932     3.98   0.000     .0873187    .2570249
       _cons |  -.1794547   .0669558    -2.68   0.007    -.3106857   -.0482237
-------------+----------------------------------------------------------------
r            |
       _cons |   .8795398   .0301839    29.14   0.000     .8203804    .9386993
------------------------------------------------------------------------------
Created 10 Halton draws per equation for 8 dimensions. Number of initial draws dropped per dimension = 15 .
Primes used:

   2   3   5   7  11  13  17  19
Also created 10 antithetic draws per dimension for 8 dimensions.  Note: there are now 20 draws per equation

scalars:
            r(n_draws) =  20
       r(n_dimensions) =  8
             r(n_burn) =  15

macros:
        r(antithetics) : "yes"
             r(prefix) : "z"
               r(type) : "halton"

matrices:
             r(primes) :  1 x 8

initial:       log likelihood =  -3223.158
rescale:       log likelihood =  -3223.158
rescale eq:    log likelihood =  -3223.158
Iteration 0:   log likelihood =  -3223.158  
Iteration 1:   log likelihood = -3222.6744  
Iteration 2:   log likelihood = -3222.6743  

Spatial Probit Model, 20 Random Draws             Number of obs   =       5560
                                                  Wald chi2(3)    =      73.97
Log likelihood = -3222.6743                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
      choice |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
choice       |
         age |  -.0056582   .0011439    -4.95   0.000    -.0079001   -.0034162
    2.gender |   .2831166   .0474778     5.96   0.000     .1900619    .3761713
    2.employ |   .1712722   .0421353     4.06   0.000     .0886884    .2538559
       _cons |  -.1912703   .0582379    -3.28   0.001    -.3054145   -.0771261
-------------+----------------------------------------------------------------
r            |
       _cons |   .9092776   .0309826    29.35   0.000     .8485528    .9700023
------------------------------------------------------------------------------
Created 20 Halton draws per equation for 8 dimensions. Number of initial draws dropped per dimension = 15 .
Primes used:

   2   3   5   7  11  13  17  19
Also created 20 antithetic draws per dimension for 8 dimensions.  Note: there are now 40 draws per equation

scalars:
            r(n_draws) =  40
       r(n_dimensions) =  8
             r(n_burn) =  15

macros:
        r(antithetics) : "yes"
             r(prefix) : "z"
               r(type) : "halton"

matrices:
             r(primes) :  1 x 8

initial:       log likelihood = -3221.2764
rescale:       log likelihood = -3221.2764
rescale eq:    log likelihood = -3221.2764
Iteration 0:   log likelihood = -3221.2764  
Iteration 1:   log likelihood = -3221.2594  
Iteration 2:   log likelihood = -3221.2594  
Iteration 3:   log likelihood = -3221.2594  

Spatial Probit Model, 40 Random Draws             Number of obs   =       5560
                                                  Wald chi2(3)    =      69.67
Log likelihood = -3221.2594                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
      choice |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
choice       |
         age |  -.0056086   .0011968    -4.69   0.000    -.0079544   -.0032628
    2.gender |   .2870557   .0476656     6.02   0.000     .1936328    .3804787
    2.employ |    .171337   .0427408     4.01   0.000     .0875666    .2551074
       _cons |  -.1960553   .0589289    -3.33   0.001    -.3115539   -.0805568
-------------+----------------------------------------------------------------
r            |
       _cons |    .914504   .0314564    29.07   0.000     .8528505    .9761574
------------------------------------------------------------------------------
Created 50 Halton draws per equation for 8 dimensions. Number of initial draws dropped per dimension = 15 .
Primes used:

   2   3   5   7  11  13  17  19
Also created 50 antithetic draws per dimension for 8 dimensions.  Note: there are now 100 draws per equation

scalars:
            r(n_draws) =  100
       r(n_dimensions) =  8
             r(n_burn) =  15

macros:
        r(antithetics) : "yes"
             r(prefix) : "z"
               r(type) : "halton"

matrices:
             r(primes) :  1 x 8

initial:       log likelihood = -3221.8657
rescale:       log likelihood = -3221.8657
rescale eq:    log likelihood = -3221.8657
Iteration 0:   log likelihood = -3221.8657  
numerical derivatives are approximate
nearby values are missing
Iteration 1:   log likelihood = -3221.8639  
Iteration 2:   log likelihood = -3221.8639  (backed up)
Iteration 3:   log likelihood = -3221.8639  

Spatial Probit Model, 100 Random Draws            Number of obs   =       5560
                                                  Wald chi2(3)    =      81.80
Log likelihood = -3221.8639                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
      choice |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
choice       |
         age |  -.0056071    .000967    -5.80   0.000    -.0075025   -.0037117
    2.gender |   .2864344   .0436226     6.57   0.000     .2009356    .3719331
    2.employ |   .1709749   .0414027     4.13   0.000     .0898272    .2521226
       _cons |  -.1952962   .0466701    -4.18   0.000    -.2867679   -.1038245
-------------+----------------------------------------------------------------
r            |
       _cons |   .9129644    .031306    29.16   0.000     .8516058    .9743231
------------------------------------------------------------------------------

. 
. // turn off log
. log off
      name:  <unnamed>
       log:  /Users/xiongyiliang/Workspace/Stata/sprobit/mle_BATS96.log
  log type:  text
 paused on:  14 Aug 2011, 18:09:36
-----------------------------------------------------------------------------------------------------------------
